Revit 2026 API

# BoundaryValidationIsValidHorizontalBoundary Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidHorizontalBoundary(
	IList<CurveLoop> curveLoops
)
```
```vb
Public Shared Function IsValidHorizontalBoundary (
	curveLoops As IList(Of CurveLoop)
) As Boolean
```
```cpp
public:
static bool IsValidHorizontalBoundary(
	IList<CurveLoop^>^ curveLoops
)
```
```fsharp
static member IsValidHorizontalBoundary :
        curveLoops : IList<CurveLoop> -> bool
```

#### Parameters

curveLoops IListCurveLoop

#### Return Value

Boolean

#### Reference

BoundaryValidation Class

Autodesk.Revit.DB Namespace